# ExportLineweightInfo Constructor (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightInfo Constructor (String)
ExportLineweightInfo Class See Also
---
Constructs a new ExportLineweightInfo using the destination line weight name as input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLineweightInfo(
	string destinationLineweightName
)
```

Visual Basic
---
```text
Public Sub New ( _
	destinationLineweightName As String _
)
```

Visual C++
---
```text
public:
ExportLineweightInfo(
	String^ destinationLineweightName
)
```

# ### Parameters
destinationLineweightName
    Type: System..::..String The destination line weight name (the name of the line weight in the exported format).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLineweightInfo Class
ExportLineweightInfo Overload
Autodesk.Revit.DB Namespace